/*******************************************************************
*文件名称:  watchdog.c
*文件标识:
*内容摘要:
*其它说明:
*当前版本:
*
*修改记录1:
*    修改日期:
*    版 本 号:
*    修 改 人:
*    修改内容:
******************************************************************/

/******************************************************************
*                             头文件                              *
******************************************************************/
#include "hardware.h"
#include "stm32f30x.h"
#include "stm32f30x_rcc.h"
#include "stm32f30x_gpio.h"
#include "watchdog.h"
/******************************************************************
*                            常量                                 *
******************************************************************/

/******************************************************************
*                           宏定义                                *
******************************************************************/

/******************************************************************
*                           数据类型                              *
******************************************************************/

/******************************************************************
*                         全局变量定义                            *
******************************************************************/

/******************************************************************
*                          局部函数声明                            *
******************************************************************/

/******************************************************************
*                         全局函数实现                            *
******************************************************************/
/******************************************************************
*函数名称:WatchDogGPIOInit
*功能描述:看门狗GPIO初始化
*输入参数:
*输出参数:
*返回值:
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2017/3/7                              lv we004
******************************************************************/
void WatchDogGPIOInit(void)
{
    GPIO_InitTypeDef  GPIO_InitStructure;

    RCC_AHBPeriphClockCmd(RCC_AHBENR_GPIOAEN, ENABLE);
    RCC_AHBPeriphClockCmd(RCC_AHBENR_GPIOBEN, ENABLE);

    GPIO_InitStructure.GPIO_Pin = WATCH_DOG_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_UP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_Level_3;
    
    GPIO_Init(WATCH_DOG_GPIO, &GPIO_InitStructure);
#if FR4XX4_CODE || (IO_CODE_TYPE == FR4124_CODE) || (IO_CODE_TYPE == FR4114_CODE)||(IO_CODE_TYPE == FR4104_CODE)

    GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_0;
    GPIO_Init(GPIOB, &GPIO_InitStructure);
    
    GPIOB->BRR = GPIO_Pin_0;
#endif
}

/******************************************************************
*函数名称:FeedTheWatchDog
*功能描述:
*输入参数:
*输出参数:
*返回值:
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2017/3/7                              lv we004
******************************************************************/
void FeedTheWatchDog(void)
{
    static uint8_t ucWDMainCount = 0;
    if (0 == ucWDMainCount)
    {
        GPIO_ResetBits(WATCH_DOG_GPIO, WATCH_DOG_PIN);
        ucWDMainCount = 1;
    }
    else
    {
        GPIO_SetBits(WATCH_DOG_GPIO, WATCH_DOG_PIN);
        ucWDMainCount = 0;
    }
}
/******************************************************************
*                         局部函数实现                            *
******************************************************************/


