/******************************************************************
*
*文件名称:  IOOptions.h
*文件标识:
*内容摘要:
*其它说明:
*当前版本:
*
*修改记录1:
*    修改日期:
*    版 本 号:
*    修 改 人:
*    修改内容:
******************************************************************/

#ifndef _IO_OPTIONS_H_
#define _IO_OPTIONS_H_

/******************************************************************
*                             头文件                              *
******************************************************************/

/******************************************************************
*                            常量                                 *
******************************************************************/

/******************************************************************
*                           宏定义                                *
******************************************************************/
/* 设备描述文件在FLASH中的起始地址*/
#define FLASH_DEVICE_INFO_START_ADDR (0x0800C000)
/* 硬件版本，产品批次等在FLASH中的起始地址 */
#define FLASH_PRODUCT_INFO_START_ADDR (0x0800D000)
/* IAP在FALSH中的起始地址 */
#define FLASH_IAP_PROGRAM_START_ADDR    (0x0800E000)

/* 升级信息在FLASH中的起始地址 */
#define FLASH_UPGRADE_INFO_START_ADDR   (0x0800FF00)

/* CSTACK大小，icf文件里定义 */
#define CSTACK_SIZE (0x800)


#define FR4024_CODE     (0x3D)    /*FR4024的代码*/

#define FR4XX4_CODE     ((IO_CODE_TYPE == FR4004_CODE) || (IO_CODE_TYPE == FR4014_CODE) || (IO_CODE_TYPE == FR4024_CODE) || (IO_CODE_TYPE == FR4504_CODE) || (IO_CODE_TYPE == FR4514_CODE)|| (IO_CODE_TYPE == FR4524_CODE))

/* 最大通道数定义*/
#define MAX_DI_CHANNEL_NUMBER   (8)     /* DI通道数 */

#define MAX_DIGITAL_CHANNEL_NUMBER  (8) /* 最大数字量通道数 */
#define MAX_AI_CHANNEL_NUMBER   (16)     /* AI通道数 */
#define MAX_AO_CHANNEL_NUMBER   (16)     /* AO通道数 */


/******************************************************************
*                           数据类型                              *
******************************************************************/

/******************************************************************
*                           全局变量声明                          *
******************************************************************/

/******************************************************************
*                         全局函数声明                            *
******************************************************************/

#endif
