/*******************************************************************
*文件名称:  warn.h
*文件标识:
*内容摘要:
*其它说明:
*当前版本:
*
*修改记录1:
*    修改日期:
*    版 本 号:
*    修 改 人:
*    修改内容:
******************************************************************/

#ifndef __WARN_H__
#define __WARN_H__

/******************************************************************
*                             头文件                              *
******************************************************************/
#include "IOOptions.h"
#include "diagnose.h"
/******************************************************************
*                            常量                                 *
******************************************************************/

/******************************************************************
*                           宏定义                                *
******************************************************************/
/* 告警数据定义 */
#define MAX_WARN_DATA_NUM   (8)     /* 最大告警数 */

#define MIN_TEMPERATURE_THRESHOLD   (-20)  /* 最小温度阈值 */
#define MAX_TEMPERATURE_THRESHOLD   (80)  /* 最大温度阈值 */

#define MAX_MCU_POWER  (522) /* 从站电源电压最大值5.88*100*/
#define MIN_MCU_POWER  (474) /* 从站电源电压最大值4.17*100*/

/*开尔文温度告警数据定义*/
#define KELVIN_MIN_TEMPERATURE_THRESHOLD   (KELVIN_TEMPERATURE + MIN_TEMPERATURE_THRESHOLD)  /*开尔文 最小温度阈值 */
#define KELVIN_MAX_TEMPERATURE_THRESHOLD   (KELVIN_TEMPERATURE + MAX_TEMPERATURE_THRESHOLD)  /* 开尔文最大温度阈值 */

#define WARN_TEMPERATURE    (0x01)    /* 温度异常告警*/
#define NOWARN_TEMPERATURE  (0xFE)    /*无温度异常告警*/
#define PIN_HIGH_LEVEL       (1)      /*引脚高电平*/
#define PIN_LOW_LEVEL          (0)      /*引脚低电平*/

#define WARN_MCU_POWER      (0x02)   /*电源电压异常告警*/
#define NOWARN_MCU_POWER    (0xFD)   /*无电源电压异常告警*/


#define IO_NO_WARN           ( 0x00 )  /*IO 无告警*/
#define CLEAR_TEXIYLINE_INTER  ( 0x00000000 )/*屏蔽中断线中断请求*/
/******************************************************************
*                           数据类型                              *
******************************************************************/

/******************************************************************
*                           全局变量声明                          *
******************************************************************/

/******************************************************************
*                         全局函数声明                            *
******************************************************************/

void WarnDataArea_Init( void );

BOOL Get_WarnStatus ( void );
#endif


