/*******************************************************************
*文件名称:  STM32GPIODriver.h
*文件标识:
*内容摘要:
*其它说明:
*当前版本:
*
*修改记录1:
*    修改日期:
*    版 本 号:
*    修 改 人:
*    修改内容:
******************************************************************/

#ifndef __STM32GPIO_H
#define __STM32GPIO_H


#pragma once 
/******************************************************************
*                             头文件                              *
******************************************************************/
#include "stm32f30x.h"
#include "stm32f30x_gpio.h"
#include "hardware.h"
/******************************************************************
*                            常量                                 *
******************************************************************/

/******************************************************************
*                           宏定义                                *
******************************************************************/
#ifndef NULL
#define NULL    ((void *)0)
#endif
    
#define ZERO       (0)

/******************************************************************
*                           数据类型                              *
******************************************************************/
typedef  enum  
{
    E_STM32_DO_GPIO_OK = 0,                      /*DO模块GPIO驱动成功*/
    E_STM32_DO_GPIO_OUTPUT_DRIVER_PARA_ERROR,       /*DO模块GPIO驱动管脚配置函数入参错误*/
    E_STM32_DO_GPIO_CONFIGURATION_PARA_ERROR,    /* 接口入参错误*/
    E_STM32_DO_GPIO_INPUT_DRIVER_PARA_ERROR,    /* 接口入参错误*/
    E_STM32_DO_GPIO_INPUT_OUTPUT_SWITCH_PARA_ERROR,   /* 接口入参错误*/
    E_STM32_DO_GPIO_BUTT
} STM32GPIODriverError_e;

/******************************************************************
*                           全局变量声明                          *
******************************************************************/

/******************************************************************
*                         全局函数声明                            *
******************************************************************/
#if FR2XX8_CODE
void STM32DOChannelInit(void);
#endif
void STM32AddressRecognition(void);

STM32GPIODriverError_e STM32GPIOInputOutputSwitch (GPIO_TypeDef *GPIOx, uint16_t usGPIOPinNum, GPIOMode_TypeDef eGPIOMode);
#endif


